app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("login", "email", "nikName", "password", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def auth

    pass =  user_params[:password]
    login = user_params[:email]
    user =User.find_by_email(login)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "login"]]

  def registration

    @user = User.new(user_params)

    @user.save
---
INSERT INTO "users" ("login", "email", "nikName", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["login", "login"], ["email", "email"], ["nikName", "nikName"], ["password", "password"], ["created_at", "2016-01-30 11:23:29.309580"], ["updated_at", "2016-01-30 11:23:29.309580"]]